Revit 2027 API
Sweep.ProfileSymbol Property
The family symbol profile details for the sweep.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FamilySymbolProfile ProfileSymbol { get; }
Public ReadOnly Property ProfileSymbol As FamilySymbolProfile
	Get
public:
property FamilySymbolProfile^ ProfileSymbol {
	FamilySymbolProfile^ get ();
}
member ProfileSymbol : FamilySymbolProfile with get
Property Value
FamilySymbolProfile
Remarks
 If the profile is not based on a profile family, this property is null.
See Also
Reference
Sweep Class
Autodesk.Revit.DB Namespace